<script setup lang="ts"></script>

<template>
  <div class="calendar-search">
    <div class="content">
      <h2>Поиск в календаре</h2>
      <p>
        Календарь содержит диапазон значений, однако поиск по нему затруднен, так как в ответе
        отсутствуют соответствующие поля, а необходимый API-запрос не предусмотрен. В параметрах
        передается лишь одна дата.
      </p>

      <h2>Проблемы поиска</h2>
      <p>
        Поиск по видам и статусам невозможен, поскольку в API отсутствуют соответствующие фильтры.
        Единственным вариантом остается клиентская фильтрация полученных данных, что не всегда
        эффективно.
      </p>

      <h2>Предлагаемое решение</h2>
      <p>
        Считаю, что вместо фильтров "Все виды" и "Статусы" целесообразнее добавить поиск по регионам
        и областям, так как API уже предоставляет соответствующие методы и параметры.
      </p>

      <h2>Дополнительные улучшения</h2>
      <ul>
        <li>Добавлен индикатор загрузки.</li>
        <li>Реализована возможность ввода номера страницы для быстрого перехода.</li>
      </ul>

      <h2>P.S.</h2>
      <ul>
        <li>
          Можно еще добавить различную фильтрацию, но как я и сказал выше, она будет не очень
          эффективна, так как будут фильтроваться только небольшие данные на клиенте, ну либо нужно
          получать вообще все данных что не очень эффективно.
        </li>
        <li>
          GULP не использовал так как ни разу им не пользовался и не понимаю как он можем мне тут
          помочь и зачем его использовать.
        </li>
      </ul>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.calendar-search {
  display: flex;
  flex-direction: column;
  align-items: center;
  justify-content: center;
}

.content {
  max-width: 600px;
  padding: 20px;
  background: #fff;
  border-radius: 10px;
  box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);
}

h2 {
  margin-top: 20px;
  font-size: 18px;
  font-weight: bold;
}

ul {
  list-style: none;
  padding: 0;
}

ul li {
  margin: 5px 0;
}
</style>
